---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.StairsRailingAngledConnection
source: html/4181db97-6bfc-837c-f7b7-2b261f0d8d2e.htm
---
# Autodesk.Revit.DB.ParameterTypeId.StairsRailingAngledConnection Property

"Angled Joins"

## Syntax (C#)
```csharp
public static ForgeTypeId StairsRailingAngledConnection { get; }
```